package 과제.과제3.Level2;

public class If문제7문제 {

	public static void main(String[] args) {
		
		/* -------문제1----- */
		
		/* -------문제2----- */
		
		/* -------문제3----- */
		
		/* -------문제4----- */
		
		/* -------문제5----- */
		
		/* -------문제6----- */
		
		/* -------문제7----- */
		
	}
}

/*
 	 문제1 : 2개의 정수를 입력받아서 더 큰수 출력 
 	 문제2 : 3개의 정수를 입력받아서 가장 큰수 출력 
 	 문제3 : 3개의 정수를 입력받아서 오름차순 으로 출력
 	 문제4 : 점수를 입력받아 점수가 90점 이상이면 합격 아니면 불합격 출력
 	
 	 문제5 : 점수를 입력받아 점수가 90점 이상이면 A등급
						점수가 80점 이상이면 B등급
						점수가 70점 이상이면 C등급
						그외 재시험
 	 문제6	
			[ 입력 ] : 국어,영어,수학 입력받기
			[ 조건 ]
				평균이 90점 이상이면서 
					국어점수 100점 이면 '국어우수' 출력
					영어점수 100점 이면 '영어우수' 출력
					수학점수 100점 이면 '수학우수' 출력
				평균이 80점 이상이면서 
					국어점수 90점이상 이면 '국어장려' 출력
					영어점수 90점이상 이면 '영어정려' 출력
					수학점수 90점이상 이면 '수학장려' 출력
				그외 재시험 
	문제7 로그인페이지
	 		[ 입력 ] : 아이디와 비밀번호를 입력받기
	 		[ 조건 ] : 회원아이디가 admin 이고 
	           			비밀번호가 1234 일 경우에는 
	          			로그인 성공 아니면 로그인 실패 출력
 */
