package 과제.과제1;

public class 과제1 {

	
}
/*
 	1. (2인1조) 연산자 암기 확인 
	 	1. 산술 
			+ 더하기		- 빼기		* 곱하기		/ 나누기=>몫		% 나누기=>나머지
		2. 비교
			> 초과   		< 미만
			>= 이상		<=이하
			== 같다		!=같지않다[다르다]
		3. 논리
			&& 	이면서 면서 이고 모두 그리고 	and
			|| 	이거나 거나 또는 하나라도  	or 	
			! 	부정[반대] true -> false  / false -> true
		4. 대입
			=  	 오른쪽값이 왼쪽으로 대입 [ 기존 데이터는 사라짐 ]
			+= 	 오른쪽값이 왼쪽값과 더하기 후에 왼쪽값에 대입
			-= *= /= %=
		5. 증감
			변수++	후위1증가		++변수	선위1증가
			변수--	후위1감소		--변수	선위1감소
		6. 삼항연산자[조건연산자]
			조건식 ? 참 : 거짓 
			(조건이 다수일경우) 조건식1 ? 조건식2 ? 참2 : 거짓2 : 거짓1
		7. 연결연산자 
			+ 연결연산자 
 	
 	2. (1인) p.73 ~ p.76 풀이 => 카톡방 과제1 git 주소
 	
		// 문제1 풀이 답 : 3
		// 문제2 풀이 답 : 1
		~~~~~
 	
 */
